import React from 'react';
import { useSelector } from 'react-redux';
import {Link} from 'react-router-dom';

import logoSvg from '../assets/img/pizza-logo.svg';
import Button from './Button';

  const modal = document.getElementById('modal')
  const btn = document.querySelector('.button')
  const contacts = document.querySelector('.modal__contacts')
  const body = document.querySelector('body')

  function handleClick() {
    document.getElementById('modal').classList.remove('modal__hidden');
      body.style.overflow = 'hidden'
  }
  function modalClick() {
    document.getElementById('modal').classList.add('modal__hidden')
      body.style.overflow = 'visible'
  }
  function contactsClick(e) {
    e.stopPropagation()
  }

function Header() {
  const { totalPrice, totalCount } = useSelector(({ cart }) => cart);

  return (

    <div className="header">
      <div className="container">
      <Link to="/">
        <div className="header__logo">
          <img width="38" src={logoSvg} alt="Pizza logo" />
          <div>
            <h1>Bella Ciao</h1>
            <p>найсмачніша піца у всесвіті</p>
          </div>
        </div>
        </Link>
        <Button onClick={handleClick} id="show__modal" className="button" >Контакти</Button>
        <div className="header__cart">
        <Link to="/cart">
        <Button className="button--cart">
          <span>{totalPrice} ₴</span>
            <div className="button__delimiter"></div>
            <svg
              width="18"
              height="18"
              viewBox="0 0 18 18"
              fill="none"
              xmlns="http://www.w3.org/2000/svg">
              <path
                d="M6.33333 16.3333C7.06971 16.3333 7.66667 15.7364 7.66667 15C7.66667 14.2636 7.06971 13.6667 6.33333 13.6667C5.59695 13.6667 5 14.2636 5 15C5 15.7364 5.59695 16.3333 6.33333 16.3333Z"
                stroke="white"
                strokeWidth="1.8"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
              <path
                d="M14.3333 16.3333C15.0697 16.3333 15.6667 15.7364 15.6667 15C15.6667 14.2636 15.0697 13.6667 14.3333 13.6667C13.597 13.6667 13 14.2636 13 15C13 15.7364 13.597 16.3333 14.3333 16.3333Z"
                stroke="white"
                strokeWidth="1.8"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
              <path
                d="M4.78002 4.99999H16.3334L15.2134 10.5933C15.1524 10.9003 14.9854 11.176 14.7417 11.3722C14.4979 11.5684 14.1929 11.6727 13.88 11.6667H6.83335C6.50781 11.6694 6.1925 11.553 5.94689 11.3393C5.70128 11.1256 5.54233 10.8295 5.50002 10.5067L4.48669 2.82666C4.44466 2.50615 4.28764 2.21182 4.04482 1.99844C3.80201 1.78505 3.48994 1.66715 3.16669 1.66666H1.66669"
                stroke="white"
                strokeWidth="1.8"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
            </svg>
            <span>{totalCount}</span>
          </Button>
        </Link>
        </div>
      </div>
      <div onClick={modalClick} id="modal" className="modal modal__hidden">
        <div className="modal__contacts">
            <img className="pizza__center" src={logoSvg} alt="Pizza logo" />
            <h2 className="contacts__header">Контакти</h2>
            <p className="contacts__text">Маєш додаткові запитання чи пропозиції, або хочеш поділитися з нами своїм відгуком? Не зволікай! Ми з радістю тебе вислухаємо! </p>
            <div className="contacts__contacts">

                <div className="contact">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M20 20H4C2.89543 20 2 19.1046 2 18V5.913C2.04661 4.84255 2.92853 3.99899 4 4H20C21.1046 4 22 4.89543 22 6V18C22 19.1046 21.1046 20 20 20ZM4 7.868V18H20V7.868L12 13.2L4 7.868ZM4.8 6L12 10.8L19.2 6H4.8Z" fill="#FF966B"/>
                    </svg>
                    <div>
                        <h4 className="contact__name">bella_ciao@gmail.com</h4>
                        <p className="contact__description">E-mail:</p>
                    </div>
                </div>

                <div className="contact">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M20 20H4C2.89543 20 2 19.1046 2 18V5.913C2.04661 4.84255 2.92853 3.99899 4 4H20C21.1046 4 22 4.89543 22 6V18C22 19.1046 21.1046 20 20 20ZM4 7.868V18H20V7.868L12 13.2L4 7.868ZM4.8 6L12 10.8L19.2 6H4.8Z" fill="#FF966B"/>
                    </svg>
                    <div>
                        <h4 className="contact__name">support@bella_ciao.com</h4>
                        <p className="contact__description">Адміністратор:</p>
                    </div>
                </div>

                <div className="contact">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M12 21.0001C10.7369 19.9227 9.56619 18.7416 8.5 17.4691C6.9 15.5581 5 12.7121 5 10.0001C4.99858 7.1676 6.70425 4.61344 9.32107 3.52945C11.9379 2.44545 14.9501 3.04529 16.952 5.04905C18.2685 6.35966 19.0059 8.14244 19 10.0001C19 12.7121 17.1 15.5581 15.5 17.4691C14.4338 18.7416 13.2631 19.9227 12 21.0001ZM12 5.00005C9.23995 5.00336 7.00331 7.24 7 10.0001C7 11.1661 7.527 13.1851 10.035 16.1861C10.6531 16.9241 11.309 17.6298 12 18.3001C12.691 17.6305 13.3472 16.926 13.966 16.1891C16.473 13.1841 17 11.1651 17 10.0001C16.9967 7.24 14.7601 5.00336 12 5.00005ZM12 13.0001C10.3431 13.0001 9 11.6569 9 10.0001C9 8.34319 10.3431 7.00005 12 7.00005C13.6569 7.00005 15 8.34319 15 10.0001C15 10.7957 14.6839 11.5588 14.1213 12.1214C13.5587 12.684 12.7957 13.0001 12 13.0001Z" fill="#FF966B"/>
                </svg>
                    <div>
                        <h4 className="contact__name">вулиця Сихівська, 13</h4>
                        <p className="contact__description">Адреса:</p>
                    </div>
                </div>
              
                <div className="contact">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M12 21.0001C10.7369 19.9227 9.56619 18.7416 8.5 17.4691C6.9 15.5581 5 12.7121 5 10.0001C4.99858 7.1676 6.70425 4.61344 9.32107 3.52945C11.9379 2.44545 14.9501 3.04529 16.952 5.04905C18.2685 6.35966 19.0059 8.14244 19 10.0001C19 12.7121 17.1 15.5581 15.5 17.4691C14.4338 18.7416 13.2631 19.9227 12 21.0001ZM12 5.00005C9.23995 5.00336 7.00331 7.24 7 10.0001C7 11.1661 7.527 13.1851 10.035 16.1861C10.6531 16.9241 11.309 17.6298 12 18.3001C12.691 17.6305 13.3472 16.926 13.966 16.1891C16.473 13.1841 17 11.1651 17 10.0001C16.9967 7.24 14.7601 5.00336 12 5.00005ZM12 13.0001C10.3431 13.0001 9 11.6569 9 10.0001C9 8.34319 10.3431 7.00005 12 7.00005C13.6569 7.00005 15 8.34319 15 10.0001C15 10.7957 14.6839 11.5588 14.1213 12.1214C13.5587 12.684 12.7957 13.0001 12 13.0001Z" fill="#FF966B"/>
                </svg>
                    <div>
                        <h4 className="contact__name">Червоної калини, 71</h4>
                        <p className="contact__description">Адреса:</p>
                    </div>
                </div>

                <div className="contact">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M8.74214 8.68189C7.66901 9.59373 7.27576 11.2567 8.20237 12.5908C9.06948 13.8392 10.1618 14.9313 11.4099 15.798C12.7441 16.7244 14.407 16.3311 15.3187 15.2579L15.3289 15.2626C16.4934 15.8021 17.7304 16.1718 19 16.3603V19H18.9989H18.9961C11.0215 19.0113 4.99148 12.9111 5.00001 5.00359V5H7.63937L7.63954 5.00117C7.828 6.27065 8.19761 7.50654 8.73714 8.67108L8.74214 8.68189ZM18.9989 21H20C20.5523 21 21 20.5523 21 20V15.4977C21 15.0021 20.637 14.5813 20.1468 14.5086L19.2926 14.3818C18.2123 14.2215 17.1605 13.9069 16.1695 13.4478L15.4166 13.0991C14.9804 12.897 14.462 13.034 14.1826 13.4253L13.8418 13.9024C13.5431 14.3206 12.9728 14.4484 12.5506 14.1552C11.4984 13.4245 10.5761 12.5024 9.84502 11.4499C9.55181 11.0277 9.67955 10.4574 10.0978 10.1587L10.5748 9.81807C10.9661 9.53861 11.1031 9.02021 10.901 8.5839L10.5518 7.83033C10.0927 6.8394 9.77823 5.78774 9.61786 4.70749L9.49104 3.85316C9.41827 3.36296 8.99745 3 8.50188 3H4.00001C3.44773 3 3.00001 3.44772 3.00001 4V5.00143C2.99029 14.0079 9.91023 21.0129 18.9989 21Z" fill="#FF966B"/>
                    </svg>
                    <div>
                        <h4 className="contact__name">+380442381657</h4>
                        <p className="contact__description">Дзвінок безкоштовний</p>
                    </div>
                </div>

                <div className="contact">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M8.74214 8.68189C7.66901 9.59373 7.27576 11.2567 8.20237 12.5908C9.06948 13.8392 10.1618 14.9313 11.4099 15.798C12.7441 16.7244 14.407 16.3311 15.3187 15.2579L15.3289 15.2626C16.4934 15.8021 17.7304 16.1718 19 16.3603V19H18.9989H18.9961C11.0215 19.0113 4.99148 12.9111 5.00001 5.00359V5H7.63937L7.63954 5.00117C7.828 6.27065 8.19761 7.50654 8.73714 8.67108L8.74214 8.68189ZM18.9989 21H20C20.5523 21 21 20.5523 21 20V15.4977C21 15.0021 20.637 14.5813 20.1468 14.5086L19.2926 14.3818C18.2123 14.2215 17.1605 13.9069 16.1695 13.4478L15.4166 13.0991C14.9804 12.897 14.462 13.034 14.1826 13.4253L13.8418 13.9024C13.5431 14.3206 12.9728 14.4484 12.5506 14.1552C11.4984 13.4245 10.5761 12.5024 9.84502 11.4499C9.55181 11.0277 9.67955 10.4574 10.0978 10.1587L10.5748 9.81807C10.9661 9.53861 11.1031 9.02021 10.901 8.5839L10.5518 7.83033C10.0927 6.8394 9.77823 5.78774 9.61786 4.70749L9.49104 3.85316C9.41827 3.36296 8.99745 3 8.50188 3H4.00001C3.44773 3 3.00001 3.44772 3.00001 4V5.00143C2.99029 14.0079 9.91023 21.0129 18.9989 21Z" fill="#FF966B"/>
                    </svg>
                    <div>
                        <h4 className="contact__name">+380936763452</h4>
                        <p className="contact__description">Дзвінок безкоштовний</p>
                    </div>
                </div>
                <div className="contact">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M8.74214 8.68189C7.66901 9.59373 7.27576 11.2567 8.20237 12.5908C9.06948 13.8392 10.1618 14.9313 11.4099 15.798C12.7441 16.7244 14.407 16.3311 15.3187 15.2579L15.3289 15.2626C16.4934 15.8021 17.7304 16.1718 19 16.3603V19H18.9989H18.9961C11.0215 19.0113 4.99148 12.9111 5.00001 5.00359V5H7.63937L7.63954 5.00117C7.828 6.27065 8.19761 7.50654 8.73714 8.67108L8.74214 8.68189ZM18.9989 21H20C20.5523 21 21 20.5523 21 20V15.4977C21 15.0021 20.637 14.5813 20.1468 14.5086L19.2926 14.3818C18.2123 14.2215 17.1605 13.9069 16.1695 13.4478L15.4166 13.0991C14.9804 12.897 14.462 13.034 14.1826 13.4253L13.8418 13.9024C13.5431 14.3206 12.9728 14.4484 12.5506 14.1552C11.4984 13.4245 10.5761 12.5024 9.84502 11.4499C9.55181 11.0277 9.67955 10.4574 10.0978 10.1587L10.5748 9.81807C10.9661 9.53861 11.1031 9.02021 10.901 8.5839L10.5518 7.83033C10.0927 6.8394 9.77823 5.78774 9.61786 4.70749L9.49104 3.85316C9.41827 3.36296 8.99745 3 8.50188 3H4.00001C3.44773 3 3.00001 3.44772 3.00001 4V5.00143C2.99029 14.0079 9.91023 21.0129 18.9989 21Z" fill="#FF966B"/>
                    </svg>
                    <div>
                        <h4 className="contact__name">+380982771556</h4>
                        <p className="contact__description">Дзвінок безкоштовний</p>
                    </div>
                </div>
            </div>
        </div>
      </div>
    </div>
  );
}
export default Header;
